spirit0908/STM32/main.c
/******************** (C) COPYRIGHT 2007 STMicroelectronics ********************
 * File Name          : main.c
 * Author             : MCD Application Team
 * Version            : V1.0
 * Date               : 10/08/2007
 * Description        : Main program body
 ********************************************************************************
 * THE PRESENT SOFTWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
 * AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
 * INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
 * CONTENT OF SUCH SOFTWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
 * INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
 *******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_lib.h"
#include "stm32f10x_usart.h"
#include "picture.h"
#include "n3310.h"
#include "stm32f10x_can.h"

#include "stm32f10x_flash.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_map.h"
#include "stm32f10x_nvic.h"
#include "stm32f10x_rcc.h"
#include "stm32f10x_type.h"

#include "teleinfo.h"
#include "Task.h"
#include "Task_cfg.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define CAN_RX_PIN 		GPIO_Pin_11
#define CAN_TX_PIN  	GPIO_Pin_12
#define CAN_RS_PIN		GPIO_Pin_5
//#define CAN_GPIO_PORT 	GPIOB


#define CAN_BAUDRATE_10KBPS		10
#define CAN_BAUDRATE_20KBPS		20
#define CAN_BAUDRATE_50KBPS		50
#define CAN_BAUDRATE_100KBPS	100
#define CAN_BAUDRATE_125KBPS	125
#define CAN_BAUDRATE_250KBPS	250
#define CAN_BAUDRATE_500KBPS	500
#define CAN_BAUDRATE_1MPBS 		1000

#define CAN_BAUDRATE CAN_BAUDRATE_125KBPS
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
GPIO_InitTypeDef GPIO_InitStructure;
ErrorStatus HSEStartUpStatus;

CAN_FilterInitTypeDef CAN_FilterInitStructure;

/* Private function prototypes -----------------------------------------------*/
void RCC_Configuration(void);
void NVIC_Configuration(void);
void Delay(vu32 nCount);

void GPIOInit(void);
void SerialInit(void);
void CanInit(void);
void ITInit(void);

//void CAN_Config(void);

/* Private functions ---------------------------------------------------------*/

CanTxMsg CanTxMessage;

/*******************************************************************************
 * Function Name  : main
 * Description    : Main program.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
int main(void)
{
#ifdef DEBUG
    debug();
#endif
//    u16 R.cvData=0;
    CanTxMsg TxMessage;

    /* SYSTEM DRIVER INIT */
    /* Configure the system clocks */
    RCC_Configuration();
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

    /* NVIC Configuration */
    NVIC_Configuration();

    /* Gpio */
    GPIOInit();
    GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);

    /* COM DRIVER INIT */
	/* Serial Port */
    SerialInit();

    /* CAN Bus */
    CanInit();

    /* Timer */
    TimerInit();

	/* Interrupt */
    ITInit();



    /* CONFIG INIT */

    /* Send START message over USART bus */
    USART_SendData(USART2, 'S');
    Delay(0xAFFFF);
    USART_SendData(USART2, 'T');
    Delay(0xAFFFF);
    USART_SendData(USART2, 'A');
    Delay(0xAFFFF);
    USART_SendData(USART2, 'R');
    Delay(0xAFFFF);
    USART_SendData(USART2, 'T');
    Delay(0xAFFFF);



    GPIO_ResetBits(GPIOB, CAN_RS_PIN);

    TxMessage.StdId = 0x444;
    TxMessage.IDE = CAN_ID_STD;
    TxMessage.RTR = CAN_RTR_DATA;
    TxMessage.DLC = 1;
    TxMessage.Data[0] = 0xAA;
    CAN_Transmit(&TxMessage);


    /* MODULE INIT */

    /* Teleinfo initialization */
    teleinfo_Init();
    USART_ITConfig(USART3, USART_IT_RXNE, ENABLE);

    /* LCD Initialization */
    LcdInit();
    LcdClear();


    while(1)
    {
    	TaskManager();
    }


    while (1)
    {
    	/* Update LCD informations */
    	LcdGotoXYFont(0,0);
		LcdStr(FONT_1X, (unsigned char *)"ADCO:");

		LcdGotoXYFont(0,1);
		LcdStr(FONT_1X, (unsigned char *)"PTEC:");

		LcdGotoXYFont(6,1);
		LcdStr(FONT_1X, (unsigned char *) &(TIC_info.PTEC[0]) );

		LcdGotoXYFont(0,2);
		LcdStr(FONT_1X, (unsigned char *)"HCHC:");

		LcdGotoXYFont(5,2);
		LcdStr(FONT_1X, (unsigned char *) &(TIC_info.HCHC[0]) );

		LcdGotoXYFont(0,3);
		LcdStr(FONT_1X, (unsigned char *)"HCHP:");

		LcdGotoXYFont(5,3);
		LcdStr(FONT_1X, (unsigned char *) &(TIC_info.HCHP[0]) );

		LcdGotoXYFont(0,4);
		LcdStr(FONT_1X, (unsigned char *)"IINST:");

		LcdGotoXYFont(7,4);
		LcdStr(FONT_1X, (unsigned char *) &(TIC_info.IINST[0]) );

//		LcdGotoXYFont(11,4);
//		LcdStr(FONT_1X, (unsigned char *)  );

		LcdUpdate();



        /* Turn on led connected to PC.4 pin */
//        GPIO_SetBits(GPIOC, GPIO_Pin_13);
        /* Insert delay */
        Delay(0xAFFFF);
//        Delay(0xAFFFF);

        /* Turn off led connected to PC.4 pin */
//        GPIO_ResetBits(GPIOC, GPIO_Pin_13);
        /* Insert delay */
        Delay(0xAFFFF);
    }
}


/*******************************************************************************
 * Function Name  : GPIOInit
 * Description    : Initializes GPIOs.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void TimerInit(void)
{
	TIM_TimeBaseInitTypeDef TIMER_InitStructure;
	NVIC_InitTypeDef NVIC_InitStructure;

    /* Timer 4 */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE); // Enable clock peripheral TIM4

    TIM_TimeBaseStructInit(&TIMER_InitStructure);
	TIMER_InitStructure.TIM_CounterMode = TIM_CounterMode_Up;
	TIMER_InitStructure.TIM_Prescaler = 7200;
	TIMER_InitStructure.TIM_Period = 50;       //5ms delay / 1sec delay: F=72000000/7200/10000 = 1sec
	TIM_TimeBaseInit(TIM4, &TIMER_InitStructure);
	TIM_ITConfig(TIM4, TIM_IT_Update, ENABLE);
	TIM_Cmd(TIM4, ENABLE);
}


void GPIOInit(void)
{
    /* Enable GPIOC clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);

    /* Enable GPIOC clock */
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);


    /* Configure PC.4 as Output push-pull */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
    GPIO_Init(GPIOC, &GPIO_InitStructure);


    /* USART1 TX */
    /* Configure PB.6 as Alternate Function Push-Pull Output - Serial TX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* USART1 RX */
    /* Configure PB.7 as Alternate Function Floating Input - Serial RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOB, &GPIO_InitStructure);


    /* USART2 TX */
    /* Configure PA.2 as Alternate Function Push-Pull Output - Serial TX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* USART2 RX */
    /* Configure PA.3 as Alternate Function Floating Input - Serial RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* USART3 TX */
    /* Configure PB.10 as Alternate Function Push-Pull Output - Serial TX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_10;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* USART3 RX */
    /* Configure PB.11 as Alternate Function Floating Input - Serial RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* CAN1 TX */
    /* Configure PA.12 as Alternate Function Push-Pull Output - CAN TX */
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12;	//CAN_TX_PIN
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz; //GPIO_Speed_10MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);

    /* CAN RX */
    /* Configure PA.11 as Alternate Function Floating Input - CAN RX */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_11;	//CAN_RX_PIN
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_2MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING; //GPIO_Mode_IPU; //GPIO_Mode_IN_FLOATING;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

