spirit0908/STM32/main.c
	/* CAN RS */
	/* Configure PA.8 as Push-Pull Output  - Relay1 */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_8;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_10MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOA, &GPIO_InitStructure);

	/* IO */
	/* Configure  */
}

/*******************************************************************************
 * Function Name  : SerialInit
 * Description    : Initializes the serial link.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void SerialInit(void)
{
	USART_InitTypeDef USART_InitStruct;

	/* *** USART1 *** */
	/* Enable USART1 clock */
	RCC_APB1PeriphClockCmd(RCC_APB2Periph_USART1, DISABLE);

	/* Enable USART  */
	USART_StructInit(&USART_InitStruct);
	USART_Cmd(USART1, DISABLE);
	USART_Init(USART1, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART1, USART_IT_RXNE, DISABLE);
	USART_ITConfig(USART1, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART1, USART_IT_TC, DISABLE);


	/* *** USART2 *** */
	/* Enable USART2 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART2, ENABLE);

	/* Enable USART  */
	USART_StructInit(&USART_InitStruct);
	USART_Cmd(USART2, ENABLE);
	USART_Init(USART2, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
	USART_ITConfig(USART2, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART2, USART_IT_TC, DISABLE);


	/* *** USART3 *** */
	/* Enable USART3 clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_USART3, ENABLE);

	/* Configure UART for EDF Teleinfo */
	USART_InitStruct.USART_BaudRate 	= 0x04B0; /* 1200 Baud */
	USART_InitStruct.USART_WordLength 	= USART_WordLength_8b;
	USART_InitStruct.USART_StopBits 	= USART_StopBits_1;
	USART_InitStruct.USART_Parity 		= USART_Parity_Even;
	USART_InitStruct.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
	USART_InitStruct.USART_Mode			= USART_Mode_Rx; 	/* Only Rx pin is configured */
	USART_InitStruct.USART_Clock 		= USART_Clock_Disable;
	USART_InitStruct.USART_CPOL 		= USART_CPOL_Low;
	USART_InitStruct.USART_CPHA 		= USART_CPHA_1Edge;
	USART_InitStruct.USART_LastBit 		= USART_LastBit_Disable;

	/* Enable USART  */
	USART_Cmd(USART3, ENABLE);
	USART_Init(USART3, &USART_InitStruct);

	/* Enable IT on USART handler */
	USART_ITConfig(USART3, USART_IT_RXNE, DISABLE);
	USART_ITConfig(USART3, USART_IT_TXE, DISABLE);
	USART_ITConfig(USART3, USART_IT_TC, DISABLE);
}

/*******************************************************************************
 * Function Name  : CanInit
 * Description    : Initializes the CAN controller module.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void CanInit(void)
{
	CAN_InitTypeDef CAN_InitStruct;

	/* Enable CAN clock */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN, ENABLE);
	GPIO_PinRemapConfig(GPIO_Remap1_CAN, DISABLE);
	GPIO_PinRemapConfig(GPIO_Remap2_CAN, DISABLE);

	/* Enable USART  */
	CAN_StructInit(&CAN_InitStruct);
//	CAN_Cmd(CAN, ENABLE);
	CAN_Init(&CAN_InitStruct);

	//Configure CAN
	CAN_StructInit(&CAN_InitStruct);

	/* CAN cell init */
	CAN_InitStruct.CAN_TTCM = DISABLE;
	CAN_InitStruct.CAN_ABOM = DISABLE;
	CAN_InitStruct.CAN_AWUM = DISABLE;
	CAN_InitStruct.CAN_NART = DISABLE;
	CAN_InitStruct.CAN_RFLM = DISABLE;
	CAN_InitStruct.CAN_TXFP = DISABLE;
	CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;

//	/* CAN Baudrate = 250kbps */
//	/* not working */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//	CAN_InitStruct.CAN_Prescaler = 4;
//
//	/* CAN Baudrate = 500kbps */
	/* not working */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_2tq;
//	CAN_InitStruct.CAN_Prescaler = 1;


#if (CAN_BAUDRATE == CAN_BAUDRATE_10KBPS)
	/* Not tested */
	//	/* CAN Baudrate = 10kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 400;
#elif CAN_BAUDRATE == CAN_BAUDRATE_20KBPS
	//	/* CAN Baudrate = 20kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 200;
#elif CAN_BAUDRATE == CAN_BAUDRATE_50KBPS
	//	/* CAN Baudrate = 50kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 80;
#elif CAN_BAUDRATE == CAN_BAUDRATE_100KBPS
	//	/* CAN Baudrate = 100kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 40;
#elif CAN_BAUDRATE == 125
	//	/* CAN Baudrate = 125kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 32;
#elif CAN_BAUDRATE == CAN_BAUDRATE_250KBPS
	//	/* CAN Baudrate = 250kbps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 16;
#elif CAN_BAUDRATE == CAN_BAUDRATE_500KBPS
	//	/* CAN Baudrate = 500kbps */
//	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//	CAN_InitStruct.CAN_Prescaler = 8;

	/* CAN Baudrate = 500kbps */
	/* or: system clock = 72MHz (PCLK1 = 36 MHz) */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_8tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_3tq;
	CAN_InitStruct.CAN_Prescaler = 6;
#elif CAN_BAUDRATE == CAN_BAUDRATE_1MPBS
	/* CAN Baudrate = 1MBps */
	CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
	CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
	CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
	CAN_InitStruct.CAN_Prescaler = 4;
#endif

	CAN_Init(&CAN_InitStruct);

