spirit0908/STM32/main.c
	  /* CAN filter init */
//	#ifdef  __CAN1_USED__
	  CAN_FilterInitStructure.CAN_FilterNumber = 0;
//	#else /*__CAN2_USED__*/
//	  CAN_FilterInitStructure.CAN_FilterNumber = 14;
//	#endif  /* __CAN1_USED__ */
	  CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
	  CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
	  CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0100 << 5;
	  CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
	  CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0700 << 5;
	  CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
	  CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
	  CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
	  CAN_FilterInit(&CAN_FilterInitStructure);

//	CAN_Init(&CAN_InitStruct);

	/* Enable IT on USART handler */
	CAN_ITConfig(CAN_IT_RQCP0, ENABLE);
	CAN_ITConfig(CAN_IT_FMP0, ENABLE);


	CAN_ITConfig(CAN_IT_RQCP1, ENABLE);	/* Request completed mailbox 1 */
	CAN_ITConfig(CAN_IT_RQCP2, ENABLE);	/* Request completed mailbox 2 */
	CAN_ITConfig(CAN_IT_TME, ENABLE);	/* Transmit mailbox empty */
	CAN_ITConfig(CAN_IT_FMP0, ENABLE);	/* FIFO 0 message pending */
	CAN_ITConfig(CAN_IT_FF0, ENABLE);	/* FIFO 0 full */
	CAN_ITConfig(CAN_IT_FOV0, ENABLE);	/* FIFO 0 overrun */
	CAN_ITConfig(CAN_IT_FMP1, ENABLE);	/* FIFO 1 message pending */
	CAN_ITConfig(CAN_IT_FF1, ENABLE);	/* FIFO 1 full */
	CAN_ITConfig(CAN_IT_FOV1, ENABLE);	/* FIFO 1 overrun */
}
//void CAN_Config(void)
//{
//  GPIO_InitTypeDef  GPIO_InitStructure;
//
//  /* GPIO clock enable */
//  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);
//  RCC_APB2PeriphClockCmd(RCC_APB1Periph_CAN);
////#ifdef  __CAN1_USED__
////  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_CAN1, ENABLE);
////#else /*__CAN2_USED__*/
////  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_CAN, ENABLE);
////#endif  /* __CAN1_USED__ */
//  /* Configure CAN pin: RX */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_RX;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
//  GPIO_Init(GPIO_CAN, &GPIO_InitStructure);
//
//  /* Configure CAN pin: TX */
//  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_CAN_TX;
//  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
//  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
//  GPIO_Init(GPIO_CAN, &GPIO_InitStructure);
//
// GPIO_PinRemapConfig(GPIO_Remapping_CAN , DISABLE);
//
//  /* CANx Periph clock enable */
//#ifdef  __CAN1_USED__
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
//#else /*__CAN2_USED__*/
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN1, ENABLE);
//  RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN2, ENABLE);
//#endif  /* __CAN1_USED__ */
//
//
//  /* CAN register init */
//  CAN_DeInit(CANx);
//  CAN_StructInit(&CAN_InitStructure);
//
//  /* CAN cell init */
//  CAN_InitStructure.CAN_TTCM = DISABLE;
//  CAN_InitStructure.CAN_ABOM = DISABLE;
//  CAN_InitStructure.CAN_AWUM = DISABLE;
//  CAN_InitStructure.CAN_NART = DISABLE;
//  CAN_InitStructure.CAN_RFLM = DISABLE;
//  CAN_InitStructure.CAN_TXFP = DISABLE;
//  CAN_InitStructure.CAN_Mode = CAN_Mode_Normal;
//
//  /* CAN Baudrate = 1MBps*/
//  CAN_InitStructure.CAN_SJW = CAN_SJW_1tq;
//  CAN_InitStructure.CAN_BS1 = CAN_BS1_3tq;
//  CAN_InitStructure.CAN_BS2 = CAN_BS2_5tq;
//  CAN_InitStructure.CAN_Prescaler = 4;
//  CAN_Init(CAN, &CAN_InitStructure);
//
//  /* CAN filter init */
//#ifdef  __CAN1_USED__
//  CAN_FilterInitStructure.CAN_FilterNumber = 0;
//#else /*__CAN2_USED__*/
//  CAN_FilterInitStructure.CAN_FilterNumber = 14;
//#endif  /* __CAN1_USED__ */
//  CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
//  CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
//  CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
//  CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
//  CAN_FilterInitStructure.CAN_FilterActivation = ENABLE;
//  CAN_FilterInit(&CAN_FilterInitStructure);
//
//  /* Transmit */
//  CanTxMessage.StdId = 0x321;
//  CanTxMessage.ExtId = 0x01;
//  CanTxMessage.RTR = CAN_RTR_DATA;
//  CanTxMessage.IDE = CAN_ID_STD;
//  CanTxMessage.DLC = 1;
//}


/*******************************************************************************
 * Function Name  : ITInit
 * Description    : Initializes the interruptions.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void ITInit(void)
{
	NVIC_InitTypeDef NVIC_InitStruct;

	/* USART1 */
	NVIC_InitStruct.NVIC_IRQChannel = USART1_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = DISABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	/* USART2 */
	NVIC_InitStruct.NVIC_IRQChannel = USART2_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	/* USART3 */
	NVIC_InitStruct.NVIC_IRQChannel = USART3_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 1;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	/* CAN */
	NVIC_InitStruct.NVIC_IRQChannel = CAN_RX1_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 200;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	NVIC_InitStruct.NVIC_IRQChannel = USB_LP_CAN_RX0_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 200;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	NVIC_InitStruct.NVIC_IRQChannel = USB_HP_CAN_TX_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelCmd = DISABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 200;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_Init(&NVIC_InitStruct);

	/* TIMER4 */
	NVIC_InitStruct.NVIC_IRQChannel = TIM4_IRQChannel;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStruct);

